{
    "website":
    [
        {
            "headerbutton": "HELLO!",
            "headertext": "HI!",
            "bodytext": "I'm Sean Flanagan, a video game designer and artist from Atlanta currently getting my B.S. in Computational Media from Georgia Tech. For years, I've loved making games and the#art that goes inside of them.##As President of VGDev, Georgia Tech's video game development club, I oversee and facilitate the development of 5-7 student-led game projects per semester."
        },
        
        {
            "headerbutton": "ANALOG#DREAMS",
            "headertext": "SCI-FI SURREALISM",
            "bodytext": "Analog Dreams is a three-hour first-person puzzle platformer, which I created over the course of five months in VGDev with a group of friends. In the game, you go on a surreal journey through a mysterious, retrofuturistic facility, inspired by games like Portal and Quantum Conundrum. ##As one of the game's two project leads and its de facto art lead, I personally artpassed and lit all 20 of the final environments in the game, establishing the art direction and modeling all the interactive props."
        },
        
        {
            "headerbutton": "DIGITAL#PAINTING",
            "headertext": "CONCEPT ART",
            "bodytext": "For a few years, I've been painting in Photoshop CS5 to create textures, character renderings, and concepts for my game projects. I work in a wide variety of styles, from cartoony and colorful to moody sci-fi, and have strong skills in lighting and game-oriented world design."
        },
        
        {
            "headerbutton": "YEGG#QUEST",
            "headertext": "IN PROGRESS",
            "bodytext": "I'm currently the project lead of a new VGDev game: a 3D collectathon platformer where you play as a rotund cartoon bird, who can roll paint around the world to complete puzzles and physics challenges.##You can view a video of the initial prototype at the right. Everything in it - modeling, texturing, rigging, animation, gameplay & shader programming - was done by me in a few weeks of work, using Unity, Photoshop CS5 and Blender."
        }
    ]
}